{
    "name": {
        "value": "{{site_name}}",
        "description": "Site name to be displayed across the app."
    },
    "slogan": {
        "value": "{{site_slogan}}",
        "description": "Site slogan to be displayed across the app."
    },
    "pagination": {
        "value": 20,
        "description": "The number of items per page to be displayed."
    },
    "uploads_max_file_size": {
        "value": 4096,
        "description": "Maximum filesize allowed for file uploads (measured in kb)."
    },
    "social": {
        "twitter": {
            "value": "",
            "description": "The official Twitter profile of the site."
        },
        "instagram": {
            "value": "",
            "description": "The official Instagran profile of the site."
        },
        "facebook": {
            "value": "",
            "description": "The official Facebook profile of the site."
        },
        "youtube": {
            "value": "",
            "description": "The official Youtube profile of the site."
        }
    },
    "aura": {
        "min_at_home": {
            "value": 10,
            "description": "The minimum aura for a writing to be displayed on homepage."
        },
        "points": {
            "writing": {
                "upvote": {
                    "value": 200,
                    "description": "How many points a writing will earn every time it gets a new upvote."
                },
                "downvote": {
                    "value": 1,
                    "description": "How many points a writing will earn every time it gets a new downvote."
                },
                "comment": {
                    "value": 100,
                    "description": "How many points a writing will earn every time it gets a new comment."
                },
                "shelf": {
                    "value": 100,
                    "description": "How many points a writing will earn every time it is saved to a user shelf."
                },
                "views": {
                    "value": 1,
                    "description": "How many points a writing will earn every time it is viewed."
                }
            },
            "user": {
                "writing": {
                    "value": 300,
                    "description": "How many points a user will earn every time he posts a new writing."
                },
                "vote": {
                    "value": 10,
                    "description": "How many points a user will earn every time he posts a new vote for an existing writing."
                },
                "comment": {
                    "value": 100,
                    "description": "How many points a user will earn every time he posts a new comment for an existing writing."
                },
                "shelf": {
                    "value": 10,
                    "description": "How many points a user will earn every time he saves an existing writing to his shelf."
                },
                "views": {
                    "value": 1,
                    "description": "How many points a user will earn every time his profile is viewed."
                },
                "hood": {
                    "value": 10,
                    "description": "How many points a user will earn every time he adds another user to his hood."
                },
                "extended_hood": {
                    "value": 50,
                    "description": "How many points a user will earn every time he is added to another users hood."
                }
            }
        }
    }
}
